---
kind: property
id: P:Autodesk.Revit.DB.RepeaterCoordinates.DimensionCount
source: html/0222077c-0971-24a1-ae42-bc65979697ad.htm
---
# Autodesk.Revit.DB.RepeaterCoordinates.DimensionCount Property

The number of dimensions of the coordinates (0, 1 or 2 for zero, one or two dimensional arrays.)

## Syntax (C#)
```csharp
public int DimensionCount { get; }
```